src/Catalogs/ВидыКонфигураций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ВидыКонфигураций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрефиксАрхива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчключитьАвтоматическуюЗагрузкуОбновлений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редакция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/РегламентныеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>РегламентныеЗадачи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГрупповойОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/РегламентныеЗаданияСервер/Ext/Module.bsl
// Общий модуль
//

//
//
Процедура ЗагрузкаОбновленийКонфигураций() Экспорт
	
	Если НЕ Константы.ЗагружатьРелизыОбновленийАвтоматически.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаЗагрузкаОбновлений = Обработки.ЗагрузкаОбновлений.Создать();
	ОбработкаЗагрузкаОбновлений.ЗагружатьРелизыОбновленийВХранилище = Константы.ЗагружатьРелизыОбновленийВХранилище.Получить();
	
	Если НЕ ЗначениеЗаполнено(Константы.КаталогОбновлений.Получить()) Тогда
		ЗаписьЖурналаРегистрации(ОбработкаЗагрузкаОбновлений.мИмяСобытияВЖурналеРегистрации +  "Регламентное задание загрузки обновлений не выполнено: не заполнен каталог обновлений", УровеньЖурналаРегистрации.Предупреждение);
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыКонфигураций.Ссылка КАК ВидКонфигурации
	|	ВидыКонфигураций.Редакция КАК Редакция
	|ИЗ
	|	Справочник.ВидыКонфигураций КАК ВидыКонфигураций
	|ГДЕ
	|	НЕ ВидыКонфигураций.ПометкаУдаления
	|	И НЕ ВидыКонфигураций.ОтчключитьАвтоматическуюЗагрузкуОбновлений";	
	
	ОбработкаЗагрузкаОбновлений.ВидыКонфигураций.Загрузить(Запрос.Выполнить().Выгрузить());
	ОбработкаЗагрузкаОбновлений.ПроверитьНаличиеОбновлений();
	ОбработкаЗагрузкаОбновлений.ЗагрузитьОбновления();
	
	// обновление АИБ
	ОбновлениеВерсииКонфигурации.ЗагрузитьОбновленияКонфигурацииАИБ();
	
КонецПроцедуры

//
//
Процедура РегламентнаяОработкаДанных(Ключ) Экспорт
	
	Если НЕ Константы.ВыполнятьРегламентнуюОбработкуДанных.Получить() Тогда
		Возврат;
	КонецЕсли;	
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ, Состояние", СокрЛП(Ключ), СостояниеФоновогоЗадания.Активно));
	Если МассивФоновыхЗаданий.Количество() = 1 Тогда
		
		РегламентнаяОработкаДанныхФоновоеЗадание(Ключ);
		
	КонецЕсли;
	
КонецПроцедуры

//
//
Процедура РегламентнаяОработкаДанныхФоновоеЗадание(Ключ) Экспорт
	
	ИмяСобытияЖурналаРегистрации = Справочники.РегламентныеЗадачи.ТэгЖурналаРегистрации();
	
	ЭлементРегламентныеЗадачи = Справочники.РегламентныеЗадачи.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Ключ)));
	
	Если ЭлементРегламентныеЗадачи <> Справочники.РегламентныеЗадачи.ПустаяСсылка() Тогда
		
		ОбъектЭлементРегламентныеЗадачи = ЭлементРегламентныеЗадачи.ПолучитьОбъект();
		Если НЕ ОбъектЭлементРегламентныеЗадачи.ПометкаУдаления И ОбъектЭлементРегламентныеЗадачи.Включено Тогда
						
			ОбработкаГрупповаяОбработка = Неопределено;			
			
			МассивПараметрыОбработки = ОбъектЭлементРегламентныеЗадачи.ПараметрыОбработки.Получить();
			
			Если МассивПараметрыОбработки <>  Неопределено И ТипЗнч(МассивПараметрыОбработки) = Тип("Массив") Тогда 
				
				ОбработкаГрупповаяОбработка = Обработки.ГрупповаяОбработка.Создать();
				Обработки.ГрупповаяОбработка.ЗаполнитьЗначенияРезультатаВыбораПараметровОбработки(ОбработкаГрупповаяОбработка, МассивПараметрыОбработки);												
				ОбработкаГрупповаяОбработка.ВыполнитьОбработку();
				
				// для параллельного выполнения
				//ПараметрыФоновогоПроцесса = Новый Массив;
				//ПараметрыФоновогоПроцесса.Добавить(Обработки.ГрупповаяОбработка.СформироватьРезультатВыбораПараметровОбработки(ОбработкаГрупповаяОбработка));
				
				//ФоновыеЗадания.Выполнить("ФоновыеПроцессыСервер.ФоновыйПроцессОбработкиПоГрупповойОбработке", ПараметрыФоновогоПроцесса, Новый УникальныйИдентификатор, ОбработкаГрупповаяОбработка.мИмяСобытияВЖурналеРегистрации);
				
			Иначе
				
				ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка, ОбъектЭлементРегламентныеЗадачи, ЭлементРегламентныеЗадачи, "Ошибочные параметры обработки! Значение не заполнено или имеет неверный формат.");
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка, ,, "Не определена запись справочника <РегламентныеЗадания>! Возможно запись была удалена.");
		
	КонецЕсли;
	
КонецПроцедуры
